XJU-Hurricane/STM32_Template/Little/f429/Drivers/bsp/Src/uart.c
    #if EN_USART3_RX
        #if USART3_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    USART3_RX_DMA_Init(4096, 128);
        #else  /* USART3_USE_DMA_RX */
    HAL_UART_Receive_IT(&USART3_Handler, (uint8_t *)g_usart3_rx_buf,
                        RXBUFFERSIZE);
        #endif /* USART3_USE_DMA_RX */
    #endif     /* EN_USART3_RX */
}
#endif /* EN_USART3 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口4
 * @{
 */

#ifdef EN_UART4
UART_HandleTypeDef UART4_Handler;
    #if EN_UART4_RX
        #if !UART4_USE_DMA_RX
uint8_t UART4_RX_BUF[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t UART4_RX_STA = 0;
uint8_t g_uart4_rx_buf[RXBUFFERSIZE];
        #endif /* !UART4_USE_DMA_RX */
/**
 * @brief 串口4中断服务函数
 */
void UART4_IRQHandler(void) {
        #if SYS_SUPPORT_OS /* 使用OS */
    OSIntEnter();
        #endif /* SYS_SUPPORT_OS */

        #if UART4_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&UART4_Handler, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&UART4_Handler);
        UART_DMARX_Idle_Callback(&UART4_Handler);
    }
        #endif /* UART4_USE_IDLE_IT */

    HAL_UART_IRQHandler(&UART4_Handler); /* 调用HAL库中断处理公用函数 */

        #if SYS_SUPPORT_OS /* 使用OS */
    OSIntExit();
        #endif /* SYS_SUPPORT_OS */
}
    #endif /* EN_UART4_RX */
/**
 * @brief 串口4初始化
 * @param bound 波特率
 */
void UART4_Init(uint32_t bound) {
    UART4_Handler.Instance = UART4;
    UART4_Handler.Init.BaudRate = bound;
    UART4_Handler.Init.WordLength = UART_WORDLENGTH_8B;
    UART4_Handler.Init.StopBits = UART_STOPBITS_1;
    UART4_Handler.Init.Parity = UART_PARITY_NONE;
    UART4_Handler.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    UART4_Handler.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&UART4_Handler);

    #if UART4_USE_DMA_TX
    /* 打开DMA发送 */
    UART4_TX_DMA_Init(2048, 128);
    #endif /* UART4_USE_DMA_TX */

    #if EN_UART4_RX
        #if UART4_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    UART4_RX_DMA_Init(4096, 128);
        #else  /* UART4_USE_DMA_RX */
    HAL_UART_Receive_IT(&UART4_Handler, (uint8_t *)g_uart4_rx_buf,
                        RXBUFFERSIZE);
        #endif /* UART4_USE_DMA_RX */
    #endif     /* EN_UART4_RX */
}
#endif /* EN_UART4 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口5
 * @{
 */

#ifdef EN_UART5
UART_HandleTypeDef UART5_Handler;
    #if EN_UART5_RX
        #if !UART5_USE_DMA_RX
uint8_t UART5_RX_BUF[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t UART5_RX_STA = 0;
uint8_t g_uart5_rx_buf[RXBUFFERSIZE];
        #endif /* !UART5_USE_DMA_RX */
/**
 * @brief 串口5中断服务函数
 */
void UART5_IRQHandler(void) {
        #if SYS_SUPPORT_OS /* 使用OS */
    OSIntEnter();
        #endif /* SYS_SUPPORT_OS */

        #if UART5_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&UART5_Handler, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&UART5_Handler);
        UART_DMARX_Idle_Callback(&UART5_Handler);
    }
        #endif /* UART5_USE_IDLE_IT */

    HAL_UART_IRQHandler(&UART5_Handler); /* 调用HAL库中断处理公用函数 */

        #if SYS_SUPPORT_OS /* 使用OS */
    OSIntExit();
        #endif /* SYS_SUPPORT_OS */
}
    #endif /* EN_UART5_RX */
/**
 * @brief 串口5初始化
 * @param bound 波特率
 */
void UART5_Init(uint32_t bound) {
    UART5_Handler.Instance = UART5;
    UART5_Handler.Init.BaudRate = bound;
    UART5_Handler.Init.WordLength = UART_WORDLENGTH_8B;
    UART5_Handler.Init.StopBits = UART_STOPBITS_1;
    UART5_Handler.Init.Parity = UART_PARITY_NONE;
    UART5_Handler.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    UART5_Handler.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&UART5_Handler);

    #if UART5_USE_DMA_TX
    /* 打开DMA发送 */
    UART5_TX_DMA_Init(2048, 128);
    #endif /* UART5_USE_DMA_TX */

    #if EN_UART5_RX
        #if UART5_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    UART5_RX_DMA_Init(4096, 128);
        #else  /* UART5_USE_DMA_RX */
    HAL_UART_Receive_IT(&UART5_Handler, (uint8_t *)g_uart5_rx_buf,
                        RXBUFFERSIZE);
        #endif /* UART5_USE_DMA_RX */
    #endif     /* EN_UART5_RX */
}
#endif /* EN_UART5 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口6
 * @{
 */

#ifdef EN_USART6
UART_HandleTypeDef USART6_Handler;
    #if EN_USART6_RX
        #if !USART6_USE_DMA_RX
uint8_t USART6_RX_BUF[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t USART6_RX_STA = 0;
uint8_t g_usart6_rx_buf[RXBUFFERSIZE];
        #endif /* !USART6_USE_DMA_RX */
/**
 * @brief 串口6中断服务函数
 */
void USART6_IRQHandler(void) {
        #if SYS_SUPPORT_OS /* 使用OS */
    OSIntEnter();
        #endif /* SYS_SUPPORT_OS */

        #if USART6_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&USART6_Handler, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&USART6_Handler);
        UART_DMARX_Idle_Callback(&USART6_Handler);
    }
        #endif /* USART6_USE_IDLE_IT */

    HAL_UART_IRQHandler(&USART6_Handler); /* 调用HAL库中断处理公用函数 */

        #if SYS_SUPPORT_OS /* 使用OS */
    OSIntExit();
        #endif /* SYS_SUPPORT_OS */
}
    #endif /* EN_USART6_RX */
/**
 * @brief 串口6初始化
 * @param bound 波特率
 */
void USART6_Init(uint32_t bound) {
    USART6_Handler.Instance = USART6;
    USART6_Handler.Init.BaudRate = bound;
    USART6_Handler.Init.WordLength = UART_WORDLENGTH_8B;
    USART6_Handler.Init.StopBits = UART_STOPBITS_1;
    USART6_Handler.Init.Parity = UART_PARITY_NONE;
    USART6_Handler.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    USART6_Handler.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&USART6_Handler);

    #if USART6_USE_DMA_TX
    /* 打开DMA发送 */
    USART6_TX_DMA_Init(2048, 128);
    #endif /* USART6_USE_DMA_TX */

    #if EN_USART6_RX
        #if USART6_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    USART6_RX_DMA_Init(4096, 128);
        #else  /* USART6_USE_DMA_RX */
    HAL_UART_Receive_IT(&USART6_Handler, (uint8_t *)g_usart6_rx_buf,
                        RXBUFFERSIZE);
        #endif /* USART6_USE_DMA_RX */
    #endif     /* EN_USART6_RX */
}
#endif /* EN_USART6 */

/**
 * @}
 */

