XJU-Hurricane/STM32_Template/Little/f429/Drivers/bsp/Src/uart.c
        GPIO_Initure.Pin = GPIO_PIN_1;
        GPIO_Initure.Mode = GPIO_MODE_AF_PP;
        GPIO_Initure.Pull = GPIO_PULLUP;
        GPIO_Initure.Speed = GPIO_SPEED_FAST;
        GPIO_Initure.Alternate = GPIO_AF8_UART8;
        HAL_GPIO_Init(GPIOE, &GPIO_Initure); /* PE1 */
        GPIO_Initure.Pin = GPIO_PIN_0;
        HAL_GPIO_Init(GPIOE, &GPIO_Initure); /* PE0 */
#if EN_UART8_RX
        HAL_NVIC_EnableIRQ(UART8_IRQn);
        HAL_NVIC_SetPriority(UART8_IRQn, 2, 2);
#endif /* EN_UART8_RX */
    }
}

/**
 * @brief 串口发送完成回调
 *
 * @param huart 串口句柄
 */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart) {
    UART_DMATX_Clear_TC_Flag(huart);
}

/**
 * @brief 串口中断回调函数
 *
 * @param huart 串口句柄
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
    /* 如果要使用某个串口的接收中断,请在头文件定义 */
    if (huart->Instance == USART1) {
#if EN_USART1_RX
    #if !USART1_USE_DMA_RX
        /**
         * 以下用于测试中断回调是否有问题,根据实际情况修改
         * 也可以将接收写在中断服务函数中
         */
        if ((USART1_RX_STA & 0x8000) == 0) {
            /* 接收未完成 */
            if (USART1_RX_STA & 0x4000) {
                /* 接收到了0x0d(即\r) */
                if (g_usart1_rx_buf[0] != 0x0a) {
                    /* 不是0x0a(即\n) */
                    USART1_RX_STA = 0; /* 接收错误,重新开始 */
                } else {
                    USART1_RX_STA |= 0x8000; /* 接收完成了 */
                }
            } else {
                /* 还没收到0x0d(即\r) */
                if (g_usart1_rx_buf[0] == 0x0d) {
                    USART1_RX_STA |= 0x4000;
                } else {
                    USART1_RX_BUF[USART1_RX_STA & 0X3FFF] = g_usart1_rx_buf[0];
                    USART1_RX_STA++;
                    if (USART1_RX_STA > (USART_REC_LEN - 1)) {
                        USART1_RX_STA = 0; /* 接收数据错误,重新开始接收 */
                    }
                }
            }
        }
        HAL_UART_Receive_IT(&USART1_Handler, (uint8_t *)g_usart1_rx_buf,
                            RXBUFFERSIZE);
    #else  /* !USART1_USE_DMA_RX */
        UART_DMARX_Done_Callback(huart);
        if (huart->hdmarx->Init.Mode != DMA_CIRCULAR) {
            while (HAL_UART_Receive_DMA(huart, huart->pRxBuffPtr,
                                        huart->RxXferSize)) {
                __HAL_UNLOCK(huart);
            }
        }
    #endif /* !USART1_USE_DMA_RX */
#endif     /* EN_USART1_RX */
    } else if (huart->Instance == USART2) {
#if EN_USART2_RX
    #if !USART2_USE_DMA_RX
        /**
         * 以下用于测试中断回调是否有问题,根据实际情况修改
         * 也可以将接收写在中断服务函数中
         */
        if ((USART2_RX_STA & 0x8000) == 0) {
            /* 接收未完成 */
            if (USART2_RX_STA & 0x4000) {
                /* 接收到了0x0d(即\r) */
                if (g_usart2_rx_buf[0] != 0x0a) {
                    /* 不是0x0a(即\n) */
                    USART2_RX_STA = 0; /* 接收错误,重新开始 */
                } else {
                    USART2_RX_STA |= 0x8000; /* 接收完成了 */
                }
            } else {
                /* 还没收到0x0d(即\r) */
                if (g_usart2_rx_buf[0] == 0x0d) {
                    USART2_RX_STA |= 0x4000;
                } else {
                    USART2_RX_BUF[USART2_RX_STA & 0X3FFF] = g_usart2_rx_buf[0];
                    USART2_RX_STA++;
                    if (USART2_RX_STA > (USART_REC_LEN - 1)) {
                        USART2_RX_STA = 0; /* 接收数据错误,重新开始接收 */
                    }
                }
            }
        }
        HAL_UART_Receive_IT(&USART2_Handler, (uint8_t *)g_usart2_rx_buf,
                            RXBUFFERSIZE);
    #else  /* !USART2_USE_DMA_RX */
        UART_DMARX_Done_Callback(huart);
        if (huart->hdmarx->Init.Mode != DMA_CIRCULAR) {
            while (HAL_UART_Receive_DMA(huart, huart->pRxBuffPtr,
                                        huart->RxXferSize)) {
                __HAL_UNLOCK(huart);
            }
        }
    #endif /* !USART2_USE_DMA_RX */
#endif     /* EN_USART2_RX */
    } else if (huart->Instance == USART3) {
#if EN_USART3_RX
    #if !USART3_USE_DMA_RX
        /**
         * 以下用于测试中断回调是否有问题,根据实际情况修改
         * 也可以将接收写在中断服务函数中
         */
        if ((USART3_RX_STA & 0x8000) == 0) {
            /* 接收未完成 */
            if (USART3_RX_STA & 0x4000) {
                /* 接收到了0x0d(即\r) */
                if (g_usart3_rx_buf[0] != 0x0a) {
                    /* 不是0x0a(即\n) */
                    USART3_RX_STA = 0; /* 接收错误,重新开始 */
                } else {
                    USART3_RX_STA |= 0x8000; /* 接收完成了 */
                }
            } else {
                /* 还没收到0x0d(即\r) */
                if (g_usart3_rx_buf[0] == 0x0d) {
                    USART3_RX_STA |= 0x4000;
                } else {
                    USART3_RX_BUF[USART3_RX_STA & 0X3FFF] = g_usart3_rx_buf[0];
                    USART3_RX_STA++;
                    if (USART3_RX_STA > (USART_REC_LEN - 1)) {
                        USART3_RX_STA = 0; /* 接收数据错误,重新开始接收 */
                    }
                }
            }
        }
        HAL_UART_Receive_IT(&USART3_Handler, (uint8_t *)g_usart3_rx_buf,
                            RXBUFFERSIZE);
    #else  /* !USART3_USE_DMA_RX */
        UART_DMARX_Done_Callback(huart);
        if (huart->hdmarx->Init.Mode != DMA_CIRCULAR) {
            while (HAL_UART_Receive_DMA(huart, huart->pRxBuffPtr,
                                        huart->RxXferSize)) {
                __HAL_UNLOCK(huart);
            }
        }
    #endif /* !USART3_USE_DMA_RX */
#endif     /* EN_USART3_RX */
    } else if (huart->Instance == UART4) {
#if EN_UART4_RX
    #if !UART4_USE_DMA_RX
        /**
         * 以下用于测试中断回调是否有问题,根据实际情况修改
         * 也可以将接收写在中断服务函数中
         */
        if ((UART4_RX_STA & 0x8000) == 0) {
            /* 接收未完成 */
            if (UART4_RX_STA & 0x4000) {
                /* 接收到了0x0d(即\r) */
                if (g_uart4_rx_buf[0] != 0x0a) {
                    /* 不是0x0a(即\n) */
                    UART4_RX_STA = 0; /* 接收错误,重新开始 */
                } else {
                    UART4_RX_STA |= 0x8000; /* 接收完成了 */
                }
            } else {
                /* 还没收到0x0d(即\r) */
                if (g_uart4_rx_buf[0] == 0x0d) {
                    UART4_RX_STA |= 0x4000;
                } else {
                    UART4_RX_BUF[UART4_RX_STA & 0X3FFF] = g_uart4_rx_buf[0];
                    UART4_RX_STA++;
                    if (UART4_RX_STA > (USART_REC_LEN - 1)) {
                        UART4_RX_STA = 0; /* 接收数据错误,重新开始接收 */
                    }
                }
            }
        }
        HAL_UART_Receive_IT(&UART4_Handler, (uint8_t *)g_uart4_rx_buf,
                            RXBUFFERSIZE);
    #else  /* !UART4_USE_DMA_RX */
        UART_DMARX_Done_Callback(huart);
        if (huart->hdmarx->Init.Mode != DMA_CIRCULAR) {
            while (HAL_UART_Receive_DMA(huart, huart->pRxBuffPtr,
                                        huart->RxXferSize)) {
                __HAL_UNLOCK(huart);
            }
        }
    #endif /* !UART4_USE_DMA_RX */
#endif     /* EN_UART4_RX */
    } else if (huart->Instance == UART5) {
#if EN_UART5_RX
    #if !UART5_USE_DMA_RX
        /**
         * 以下用于测试中断回调是否有问题,根据实际情况修改
         * 也可以将接收写在中断服务函数中
         */
        if ((UART5_RX_STA & 0x8000) == 0) {
            /* 接收未完成 */
            if (UART5_RX_STA & 0x4000) {
                /* 接收到了0x0d(即\r) */
                if (g_uart5_rx_buf[0] != 0x0a) {
                    /* 不是0x0a(即\n) */
                    UART5_RX_STA = 0; /* 接收错误,重新开始 */
                } else {
                    UART5_RX_STA |= 0x8000; /* 接收完成了 */
                }
            } else {
                /* 还没收到0x0d(即\r) */
                if (g_uart5_rx_buf[0] == 0x0d) {
                    UART5_RX_STA |= 0x4000;
                } else {
                    UART5_RX_BUF[UART5_RX_STA & 0X5FFF] = g_uart5_rx_buf[0];
                    UART5_RX_STA++;
                    if (UART5_RX_STA > (USART_REC_LEN - 1)) {
                        UART5_RX_STA = 0; /* 接收数据错误,重新开始接收 */
                    }
                }
            }
        }
        HAL_UART_Receive_IT(&UART5_Handler, (uint8_t *)g_uart5_rx_buf,
                            RXBUFFERSIZE);
    #else  /* !UART5_USE_DMA_RX */
        UART_DMARX_Done_Callback(huart);
        if (huart->hdmarx->Init.Mode != DMA_CIRCULAR) {
            while (HAL_UART_Receive_DMA(huart, huart->pRxBuffPtr,
                                        huart->RxXferSize)) {
                __HAL_UNLOCK(huart);
            }
        }
    #endif /* !UART5_USE_DMA_RX */
#endif     /* EN_UART5_RX */
    } else if (huart->Instance == USART6) {
#if EN_USART6_RX
    #if !USART6_USE_DMA_RX
        /**
         * 以下用于测试中断回调是否有问题,根据实际情况修改
         * 也可以将接收写在中断服务函数中
         */
        if ((USART6_RX_STA & 0x8000) == 0) {
            /* 接收未完成 */
            if (USART6_RX_STA & 0x4000) {
                /* 接收到了0x0d(即\r) */
                if (g_usart6_rx_buf[0] != 0x0a) {
                    /* 不是0x0a(即\n) */
                    USART6_RX_STA = 0; /* 接收错误,重新开始 */
                } else {
                    USART6_RX_STA |= 0x8000; /* 接收完成了 */
                }
            } else {
                /* 还没收到0x0d(即\r) */
                if (g_usart6_rx_buf[0] == 0x0d) {
                    USART6_RX_STA |= 0x4000;
                } else {
                    USART6_RX_BUF[USART6_RX_STA & 0X3FFF] = g_usart6_rx_buf[0];
                    USART6_RX_STA++;
                    if (USART6_RX_STA > (USART_REC_LEN - 1)) {
                        USART6_RX_STA = 0; /* 接收数据错误,重新开始接收 */
                    }
                }
            }
        }
        HAL_UART_Receive_IT(&USART6_Handler, (uint8_t *)g_usart6_rx_buf,
                            RXBUFFERSIZE);
    #else  /* !USART6_USE_DMA_RX */
        UART_DMARX_Done_Callback(huart);
        if (huart->hdmarx->Init.Mode != DMA_CIRCULAR) {
            while (HAL_UART_Receive_DMA(huart, huart->pRxBuffPtr,
                                        huart->RxXferSize)) {
                __HAL_UNLOCK(huart);
            }
        }
    #endif /* !USART6_USE_DMA_RX */
#endif     /* EN_USART6_RX */
    } else if (huart->Instance == UART7) {
#if EN_UART7_RX
    #if !UART7_USE_DMA_RX
        /**
         * 以下用于测试中断回调是否有问题,根据实际情况修改
         * 也可以将接收写在中断服务函数中
         */
        if ((UART7_RX_STA & 0x8000) == 0) {
            /* 接收未完成 */
            if (UART7_RX_STA & 0x4000) {
                /* 接收到了0x0d(即\r) */
                if (g_uart7_rx_buf[0] != 0x0a) {
                    /* 不是0x0a(即\n) */
                    UART7_RX_STA = 0; /* 接收错误,重新开始 */
                } else {
                    UART7_RX_STA |= 0x8000; /* 接收完成了 */
                }
            } else {
                /* 还没收到0x0d(即\r) */
                if (g_uart7_rx_buf[0] == 0x0d) {
                    UART7_RX_STA |= 0x4000;
                } else {
                    UART7_RX_BUF[UART7_RX_STA & 0X7FFF] = g_uart7_rx_buf[0];
                    UART7_RX_STA++;
                    if (UART7_RX_STA > (USART_REC_LEN - 1)) {
                        UART7_RX_STA = 0; /* 接收数据错误,重新开始接收 */
                    }
                }
            }
        }
        HAL_UART_Receive_IT(&UART7_Handler, (uint8_t *)g_uart7_rx_buf,
                            RXBUFFERSIZE);
    #else  /* !UART7_USE_DMA_RX */
        UART_DMARX_Done_Callback(huart);
        if (huart->hdmarx->Init.Mode != DMA_CIRCULAR) {
            while (HAL_UART_Receive_DMA(huart, huart->pRxBuffPtr,
                                        huart->RxXferSize)) {
                __HAL_UNLOCK(huart);
            }
        }
    #endif /* !UART7_USE_DMA_RX */
#endif     /* EN_UART7_RX */
    } else if (huart->Instance == UART8) {
#if EN_UART8_RX
    #if !UART8_USE_DMA_RX
        /**
         * 以下用于测试中断回调是否有问题,根据实际情况修改
         * 也可以将接收写在中断服务函数中
         */
        if ((UART8_RX_STA & 0x8000) == 0) {
            /* 接收未完成 */
            if (UART8_RX_STA & 0x4000) {
                /* 接收到了0x0d(即\r) */
                if (g_uart8_rx_buf[0] != 0x0a) {
                    /* 不是0x0a(即\n) */
                    UART8_RX_STA = 0; /* 接收错误,重新开始 */
                } else {
                    UART8_RX_STA |= 0x8000; /* 接收完成了 */
                }
            } else {
                /* 还没收到0x0d(即\r) */
                if (g_uart8_rx_buf[0] == 0x0d) {
                    UART8_RX_STA |= 0x4000;
                } else {
                    UART8_RX_BUF[UART8_RX_STA & 0X8FFF] = g_uart8_rx_buf[0];
                    UART8_RX_STA++;
                    if (UART8_RX_STA > (USART_REC_LEN - 1)) {
                        UART8_RX_STA = 0; /* 接收数据错误,重新开始接收 */
                    }
                }
            }
        }
        HAL_UART_Receive_IT(&UART8_Handler, (uint8_t *)g_uart8_rx_buf,
                            RXBUFFERSIZE);
    #else  /* !UART8_USE_DMA_RX */
        UART_DMARX_Done_Callback(huart);
        if (huart->hdmarx->Init.Mode != DMA_CIRCULAR) {
            while (HAL_UART_Receive_DMA(huart, huart->pRxBuffPtr,
                                        huart->RxXferSize)) {
                __HAL_UNLOCK(huart);
            }
        }
    #endif /* !UART8_USE_DMA_RX */
#endif     /* EN_UART8_RX */
    }
}

/**
 * @brief 串口接收半满回调
 *
 * @param huart 串口句柄
 */
void HAL_UART_RxHalfCpltCallback(UART_HandleTypeDef *huart) {
    UART_DMARX_HalfDone_Callback(huart);
}

/**
 * @brief 串口错误回调
 *
 * @param huart 串口句柄
 */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart) {
    __IO uint32_t tmpErr = 0x00U;

    tmpErr = HAL_UART_GetError(huart);
    if (HAL_UART_ERROR_NONE == tmpErr) {
        return;
    }

    switch (tmpErr) {
        case HAL_UART_ERROR_PE:
            __HAL_UART_CLEAR_PEFLAG(huart);
            break;
        case HAL_UART_ERROR_NE:
            __HAL_UART_CLEAR_NEFLAG(huart);
            break;
        case HAL_UART_ERROR_FE:
            __HAL_UART_CLEAR_FEFLAG(huart);
            break;
        case HAL_UART_ERROR_ORE:
            __HAL_UART_CLEAR_OREFLAG(huart);
            break;
        case HAL_UART_ERROR_DMA:

            break;
        default:
            break;
    }

    if (NULL != huart->hdmarx) {
        while (
            HAL_UART_Receive_DMA(huart, huart->pRxBuffPtr, huart->RxXferSize)) {
            __HAL_UNLOCK(huart);
        }
    } else {
        /* 恢复接收地址指针到初始 buffer 位置 ，初始地址 = 当前地址 -
         * 已接收的数据个数，已接收的数据个数 = 需要接收数 - 还未接收数*/
        while (HAL_UART_Receive_IT(
            huart, huart->pRxBuffPtr - (huart->RxXferSize - huart->RxXferCount),
            huart->RxXferSize)) {
            __HAL_UNLOCK(huart);
        }
    }
}

/**
 * @brief 指定串口输出
 * @param huart 串口句柄指针
 * @param __format 欲输出的内容,类似于printf格式
 */
void uart_print(UART_HandleTypeDef *huart, const char *__format, ...) {
    int len;
    va_list ap;
    va_start(ap, __format);

    /* 清空发送缓冲区 */
    memset(USART_TX_Buf, 0x0, TX_BUF_LEN);

    /* 填充发送缓冲区 */
    vsnprintf((char *)USART_TX_Buf, TX_BUF_LEN, (const char *)__format, ap);
    va_end(ap);
    len = strlen((const char *)USART_TX_Buf);

    /* 往串口发送数据 */
    HAL_UART_Transmit(huart, (uint8_t *)&USART_TX_Buf, len, 0xFFFF);
}

/**
 * @}
 */

